test_result/fio-3.28-4R5J0001-sw-1G-qd4-num1-1024K-3000-WT.txt
fio-3.28-4R5J0001-write-1G-4-1-1024K: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=4
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685961,
  "timestamp_ms" : 1750685961266,
  "time" : "Mon Jun 23 21:39:21 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-write-1G-4-1-1024K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-write-1G-4-1-1024K",
        "filename" : "/dev/sda",
        "rw" : "write",
        "bs" : "1024K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "4",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "write" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 1130254551,
        "bw" : 1103764,
        "iops" : 1077.894737,
        "runtime" : 950,
        "total_ios" : 1024,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 52444,
          "max" : 164176,
          "mean" : 128807.154297,
          "stddev" : 13326.110165,
          "N" : 1024
        },
        "clat_ns" : {
          "min" : 2334443,
          "max" : 4850910,
          "mean" : 3571379.923828,
          "stddev" : 665619.715610,
          "N" : 1024,
          "percentile" : {
            "1.000000" : 2965504,
            "5.000000" : 2998272,
            "10.000000" : 3096576,
            "20.000000" : 3096576,
            "30.000000" : 3096576,
            "40.000000" : 3096576,
            "50.000000" : 3129344,
            "60.000000" : 3129344,
            "70.000000" : 4489216,
            "80.000000" : 4489216,
            "90.000000" : 4489216,
            "95.000000" : 4489216,
            "99.000000" : 4620288,
            "99.500000" : 4685824,
            "99.900000" : 4751360,
            "99.950000" : 4882432,
            "99.990000" : 4882432
          },
          "bins" : {
            "2342912" : 1,
            "2834432" : 1,
            "2867200" : 1,
            "2899968" : 2,
            "2932736" : 1,
            "2965504" : 11,
            "2998272" : 51,
            "3031040" : 7,
            "3063808" : 24,
            "3096576" : 387,
            "3129344" : 132,
            "3162112" : 2,
            "3194880" : 6,
            "3227648" : 33,
            "3260416" : 19,
            "3293184" : 4,
            "3686400" : 1,
            "4145152" : 1,
            "4358144" : 15,
            "4423680" : 7,
            "4489216" : 270,
            "4554752" : 9,
            "4620288" : 30,
            "4685824" : 6,
            "4751360" : 2,
            "4882432" : 1
          }
        },
        "lat_ns" : {
          "min" : 2421948,
          "max" : 4927042,
          "mean" : 3700994.797852,
          "stddev" : 664451.633463,
          "N" : 1024
        },
        "bw_min" : 1101824,
        "bw_max" : 1101824,
        "bw_agg" : 99.824219,
        "bw_mean" : 1101824.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 1,
        "iops_min" : 1076,
        "iops_max" : 1076,
        "iops_mean" : 1076.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 1
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 949,
      "usr_cpu" : 6.533193,
      "sys_cpu" : 13.593256,
      "ctx" : 1023,
      "majf" : 0,
      "minf" : 12,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.195312,
        "4" : 99.707031,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 66.699219,
        "10" : 33.300781,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 46,
      "write_ios" : 945,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 3,
      "write_ticks" : 3385,
      "in_queue" : 3387,
      "util" : 90.927625
    }
  ]
}

fio-3.28-4R5J0001-write-1G-4-1-1024K: (groupid=0, jobs=1): err= 0: pid=85973: Mon Jun 23 21:39:21 2025
  write: IOPS=1077, BW=1078MiB/s (1130MB/s)(1024MiB/950msec); 0 zone resets
    slat (usec): min=52, max=164, avg=128.81, stdev=13.33
    clat (usec): min=2334, max=4850, avg=3571.38, stdev=665.62
     lat (usec): min=2421, max=4927, avg=3700.99, stdev=664.45
    clat percentiles (usec):
     |  1.00th=[ 2966],  5.00th=[ 2999], 10.00th=[ 3097], 20.00th=[ 3097],
     | 30.00th=[ 3097], 40.00th=[ 3097], 50.00th=[ 3130], 60.00th=[ 3130],
     | 70.00th=[ 4490], 80.00th=[ 4490], 90.00th=[ 4490], 95.00th=[ 4490],
     | 99.00th=[ 4621], 99.50th=[ 4686], 99.90th=[ 4752], 99.95th=[ 4883],
     | 99.99th=[ 4883]
   bw (  MiB/s): min= 1076, max= 1076, per=99.82%, avg=1076.00, stdev= 0.00, samples=1
   iops        : min= 1076, max= 1076, avg=1076.00, stdev= 0.00, samples=1
  lat (msec)   : 4=66.70%, 10=33.30%
  cpu          : usr=6.53%, sys=13.59%, ctx=1023, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.2%, 4=99.7%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=1078MiB/s (1130MB/s), 1078MiB/s-1078MiB/s (1130MB/s-1130MB/s), io=1024MiB (1074MB), run=950-950msec

Disk stats (read/write):
  sda: ios=46/945, merge=0/0, ticks=3/3385, in_queue=3387, util=90.93%